[
{"data":"He was supposed to visit me tonight but he decided to stop in Tacoma so now I'm sitting on my bed naked eating oranges and candy corn while I watch Parks and Rec.","types":["bad"]},
{"data":"Now I have to hook up with him tomorrow DURING THE DAY.","types":["bad"]},
{"data":"He is really real. Like I know where he works, have referenced him with mutual fb friends and I've seen his dick. He's real.","types":["bad"]},
{"data":"My roomate has me out looking for easter kegs hidden arround town","types":["bad"]},
{"data":"You ruined me. I can't stop referring to everything outside as the no-walls ever since you showed me that video while I was tripping balls. My speech may be permanently altered for the rest of earth spins","types":["bad"]},
{"data":"Yeah..I guess you know your hair looks like shit when TSA asks to inspect it","types":["bad"]},
{"data":"I couldn't drink enough to fuck the friend, you said challenge accepted and stole some chicks shot.","types":["bad"]},
{"data":"I think he's hit rock bottom. You know it's a low point in life when you cry because you weren't invited to sit in a box car and watch porn with two other straight dudes.","types":["bad"]},
{"data":"If his smile makes you freak out and drop things imagine what his penis could do","types":["bad"]},
{"data":"I'm home alone drinking wine, so high, scrubbing my house down... This is what my thirsty thursday has become","types":["bad"]},
{"data":"Also this guy fingered me at the bar and then gave me his card","types":["bad"]},
{"data":"Mainly I just wanna pet bunnies. And purple chicks. Well any color chicks if I close my eyes. But purple if I open them.","types":["bad"]},
{"data":"Yo if you blacked out last night, careful going through your purse. There's cocaine in a lollipop wrapper.","types":["bad"]},
{"data":"Look on the bright side: Now that I'm sleeping with both the exs it's good bye to drunk sexting the 'wrong one'.","types":["bad"]},
{"data":"why is there a chinchilla in our apartment, and where did it come from?","types":["bad"]},
{"data":"question nothing. DON'T QUESTION A FREE CHINCHILLA.","types":["bad"]},
{"data":"Wait... All I had to do was ask for a sandwich and you would have come over","types":["bad"]},
{"data":"I'm hungover from arbor mist  I'm so white","types":["bad"]},
{"data":"There is not enough soap in the world to make me feel clean after last night. Im gonna need jesus for this one","types":["bad"]},
{"data":"Is it really bad that my last patient offered to fuck my brains out if I gave her IV morphine...and I gave her my phone number and told her when my shift is over?","types":["bad"]},
{"data":"I don't think you should be sorry for such memorable sex that I yell your name when you aren't around.","types":["bad"]},
{"data":"I tore the muscle in my left calf at the gym and still spent all evening in heels. UNSTOPPABLE!","types":["bad"]},
{"data":"1) I'm a decent drunk texter. 2) My world is spinning. 3) I'll give you a dollar and a hug for a glass of water. 4) I love you. 5) Example: your penatrive ways are overwhelming my alternative lyfestyle. 6) That is all.","types":["bad"]},
{"data":"7) Noodle arms: engage","types":["bad"]},
{"data":"The example was me just using big words while hammered. You're welcome. Ambidextrious. I spelled it right.","types":["bad"]},
{"data":"we found him passed out on the baseball field with two 40oz and wearing a tophat.","types":["bad"]},
{"data":"Where did he get the tophat?","types":["bad"]},
{"data":"hand jobs are a waste of time that only lead to arm cramps. Also, where do you look...his eyes, at the penis, at the tv?","types":["bad"]},
{"data":"yeah the where to look question is super awkward","types":["bad"]},
{"data":"A very confused plastic surgeon just called. Apparently I called asking how much it costs to get a vodka funnel installed straight to my brain...","types":["bad"]},
{"data":"Well, I made it all the way to the gas station. And from there, I begged a cab driver who was parked outside, to give me a piggy back ride the final 2 blocks to my apartment. I wasn't in the cab. Didn't have to pay. Drunk me is smart, and very lazy.","types":["bad"]},
{"data":"That awkward moment when the dude you blew on camera in college friend requests you on Facebook. ","types":["bad"]},
{"data":"Who is this?!????","types":["bad"]},
{"data":"That awkward moment when you think you're texting a friend the above statement, but instead you text a stranger.","types":["bad"]},
{"data":"You kept saying we got to find the end of the rainbow, which turned out to be a box of lucky charms and Guinness in the bag of cereal","types":["bad"]},
{"data":"I don't know if trying Molly for the first time before my flight was an awesome or aweful idea","types":["bad"]},
{"data":"just because the DWI class is located at the University does not make him a professor. I was duped, he is in no way, shape or form a professor!","types":["bad"]},
{"data":"I'm turning twenty &amp; the only honorable way to exit my teens is by slapping the fuck outta the bag. You better be in.","types":["bad"]},
{"data":"And literally 4loko margaritas are callin my name. They're like Hey girl come on over here I'll make you forget about grades and boys and it'll be a good idea to send everyone 55 snapchats of your cleavage","types":["bad"]},
{"data":"Do you miss the park or do you miss us having sex in public?","types":["bad"]},
{"data":"Do to my newly discovered condition I'm having to resort to emergency beat sessions to avoid the temptation to text girls I know are easy slams.","types":["bad"]},
{"data":"Classic dick move. Breaking up your buddies 3-some by coming into his room and doing the Harlem Shake.","types":["bad"]},
{"data":"So you're mad that you saw a penis at a swinger's party? That's rational","types":["bad"]},
{"data":"The don't have sex with him again alerts you set on my phone just started going off. ","types":["bad"]},
{"data":"Good. Seriously, don't do it should start in about five minutes.","types":["bad"]},
{"data":"You've thrown off my entire schedule. Usually SATURDAYS are my try to hide the jizz on my leggings days","types":["bad"]},
{"data":"Just dodged a state trooper, your weed will be there shortly. Fear the unbustable!","types":["bad"]},
{"data":"I cannot describe the pre-ejaculative horrors thru the medium of text messaging","types":["bad"]},
{"data":"You just kept stroking his beard and thinking aloud that you wanted to rub your face all over it.","types":["bad"]},
{"data":"We both got free alcohol and got laid by foreign men last night.","types":["bad"]},
{"data":"I'm not going out again for the rest of my life. I can't top this.","types":["bad"]},
{"data":"I was just doing the math on how much beer we need for the houseboat. in doing so, I came to the conclusion that we need to open a beer distributor business.","types":["bad"]},
{"data":"We were in the middle of fucking and she was just like Do ya wanna play Harry Potter Scene It? I musta been really bad lol Anyways, her tattoo healed nicely.","types":["bad"]},
{"data":"Even dream me is a champ at smoking weed","types":["bad"]},
{"data":"he fucked me with his goalie mask on. it was like sleeping with Darth Vader","types":["bad"]},
{"data":"Who knows. Maybe the world would be a better place if more people sent their drug dealers thank you cards.","types":["bad"]},
{"data":"Dude, all I know is that I came out of this thing wearing a snorkel mask and completely covered in glitter and soap.","types":["bad"]},
{"data":"Did he ask you why you were in his back yard Sunday night?","types":["bad"]},
{"data":"There's s woman at the corner of the bar dancing by herself in her seat and making eye contact with me. Please hurry.","types":["bad"]},
{"data":"Also. When I die, I'm gonna have them put me in the casket naked and then have an open casket funeral. That will be my last chance to make people uncomfortable.","types":["bad"]},
{"data":"The psychic I saw today told me NOT to text the guy I haven't heard from yet since our first date this weekend b/c it wouldn't go anywhere...Miller light said otherwise. Miller light &gt; Cleo","types":["bad"]},
{"data":"Whoever put the rooster in the elevator is my fucking hero. Who even thinks of that shit?","types":["bad"]},
{"data":"It gives me purpose in life to help fulfill nerdy fantasies. Like I'm doing something good for mankind and having multiple orgasms in the process.","types":["bad"]},
{"data":"Can you pick up from work today? There's a surprise for you on the bed and I haven't gone blind which is positive.","types":["bad"]},
{"data":"What are your plans?","types":["bad"]},
{"data":"Get picked up. Convince you to leave work. Smoke. Drink. Fly helicopters.","types":["bad"]},
{"data":"I don't know what to say to that. All I know is my vagina is trying to jump through the phone.","types":["bad"]},
{"data":"Sorry, I was trapped in a small closet behind a washer. What's up?","types":["bad"]},
{"data":"How do you explain to a guy that he's like a little puppy dog that you play with, but then leave at the shelter to go home to your German Shepard?","types":["bad"]},
{"data":"first thing my tuition money buys is a strap on","types":["bad"]},
{"data":"I'm sure we could go all project runway on our diapers  and create some flattering absorbent thongs. We could do it on the Boat. Call it project rumway.","types":["bad"]},
{"data":"Well I'm in the bathtub smoking a bowl and eating doritos and frosting so I might not be the one to advise you on this shit but I'll try.","types":["bad"]},
{"data":"How bad would it be if I wore out the dress we got peed on in. You're the only one who knows.","types":["bad"]},
{"data":"Just found dollar bills in my sheets. What part of the weekend am I forgetting?","types":["bad"]},
{"data":"He was humming here comes Peter cottontail while unbuttoning his pants. Happy Easter to me","types":["bad"]},
{"data":"The wizard has you scheduled for a 6am sex breakfast","types":["bad"]},
{"data":"The fun I thought I would be having now when I was six is vastly different from what I am currently doing. Hurraaay sex and vicodin.","types":["bad"]},
{"data":"He just snapchatted me a picture of his cock. The angle makes it look like a freakin skyscraper. Thinking of photoshopping a little monkey on it.","types":["bad"]},
{"data":"One small step for man, one big gay fierce leap for gays!","types":["bad"]},
{"data":"Let me tell you how my drug dealer wants me to take his girlfriends little sister to jr prom","types":["bad"]},
{"data":"I find it ironic...the gays are dying to get married &amp; I just want a fucking divorce","types":["bad"]},
{"data":"I vaguely remember hanging my bra off the ceiling fan and chugging a beer during sex","types":["bad"]},
{"data":"College has turned you into quite the multi tasker huh?","types":["bad"]},
{"data":"Check the mailbox while you're out!","types":["bad"]},
{"data":"I already looked this morning. You go check and see what you won on Ebay after your day drinking spree.","types":["bad"]},
{"data":"If I don't get my shit together, I'm going to be one of those really fucked up cases on 1000 ways to die","types":["bad"]},
{"data":"It's like when your main girl and your side girl start having their period in the same week ","types":["bad"]},
{"data":"You are the most depressed sports fan I know","types":["bad"]},
{"data":"This is what my life has come to. Like, I may or may not have just stolen pizza from the guy I just hooked up with's fridge when I left...","types":["bad"]},
{"data":"If, when you wake up, you're wondering why you're in the bathtub, it's because when I tried to move you, you yelled that that was cheating and tried to kick me in the face.","types":["bad"]},
{"data":"sex on the stairs. not our finest idea.","types":["bad"]},
{"data":"You were so proud of your stupid magic trick but all you did was piss on the couch. don't talk to me for a few days.","types":["bad"]},
{"data":"you stole two subs and a drink from jimmy johns and walked out yelling get at me bitches","types":["bad"]},
{"data":"I think god invented us with two hands so we can grab an ass and spank it at the same time.","types":["bad"]},
{"data":"my vagina is starting to think like a penis, and I'm not even slightly worried","types":["bad"]},
{"data":"When you're awkward as a teenager, it never goes away. You just mask it. With makeup. And boobs.","types":["bad"]},
{"data":"I got so drunk at the hockey game I bought everyone behind me in concession line a funnel cake.","types":["bad"]},
{"data":"On the way out the door to work grabbed the wine glass on the floor left for the ghost of Elijah and chugged it. PASSOVER.","types":["bad"]},
{"data":"Are you kidding me????? How bout, IM SORRY FOR CALLING YOU 16 TIMES AND LEAVING YOU A TWO MINUTE VOICEMAIL OF MYSELF THROWING UP.","types":["bad"]},
{"data":"first time i ever mailed panties back to a fuck buddy. what better of a way to say its over","types":["bad"]},
{"data":"not a day goes by that I don't wish you were here or I there. Today it was because I had the desire to get high and go look at the jellyfish at the aquarium and you're the perfect buddy","types":["bad"]},
{"data":"Just considered playing a drinking game with powerade with my sister so she would get some fluids in her. I do so well with sick people.","types":["bad"]},
{"data":"Bought asot tix too. After Saturday I'm gonna be reborn like Jesus and no drugs until edc","types":["bad"]},
{"data":"I don't care how much you're grieving a loss, masturbating off the side of a roof is not acceptable mourning behavior","types":["bad"]},
{"data":"He rubbed my back afterwards. I forgot how to talk and I legitimately thought I was a cat for a few minutes.","types":["bad"]},
{"data":"We don't have any ice, so I'm using the frozen cognac to reduce the swelling on Abby's toe.","types":["bad"]},
{"data":"I will not have sex with him.","types":["bad"]},
{"data":"I think I may be the only girl in the world that can say she has fallen asleep grasping a penis..... 3 different times...... 3 different penises","types":["bad"]},
{"data":"I think our prof has caught onto our drinking game. He burst into the room with a big smile on his face and yelled essentially! Essentially! Essentially!","types":["bad"]},
{"data":"I've had three separate encounters with cops in the last 9 hours.... In two different states","types":["bad"]},
{"data":"Are you stuck outside of your house because you forgot to walk up stairs? Cuz I've been there.","types":["bad"]},
{"data":"i want to live in a society where a 20 year old can wear pigtails and not get them called handlebars, because i look fucking adorable in them.","types":["bad"]},
{"data":"Obviously. I'm here to let you eat things off my boobs and help you get laid.","types":["bad"]},
{"data":"Are you high? The snorkel mask makes that pretty clear","types":["bad"]},
{"data":"You remember the guy they called Meat in high school? Well, let's just say my vagina remembers him now.","types":["bad"]},
{"data":"I think I'm going to add the date I dumped his sorry ass as a life event on FB.","types":["bad"]},
{"data":"I'm not going to pass up the opportunity to be half naked and covered in glitter without facing judgement or legal prosecution. I'll be there.","types":["bad"]},
{"data":"Do you still have be bumpin written on your ass in glitter pen? Who brings a glitter pen to a bar? Or pulls there ass out for that matter...","types":["bad"]},
{"data":"Almost to work. And still feel hungover. Like my body is trying to regenerate after dying. Full on zombie shit. But like, one of those zombies from warm bodies that comes back to life","types":["bad"]},
{"data":"It's a 'fuck poison control' kind of night.","types":["bad"]},
{"data":"I need to get a job that holds me accountable for something. Otherwise I wake upon Monday wondering when the booze store opens and if I still have a boyfriend.","types":["bad"]},
{"data":"Dollar Store pregnancy tests. For when you sorta wanta  know.","types":["bad"]},
{"data":"They have marijuana tests too!","types":["bad"]},
{"data":"So you get idea of what my night was like, I woke up this morning and the back of my head was orange","types":["bad"]},
{"data":"You told the cop you where the star of the Track team and tried to run away. So yeah, i'm not surprised.","types":["bad"]},
{"data":"Bless her heart. Her stupid, drunk, adderall-ed heart.","types":["bad"]},
{"data":"The point remains that this is the setup for some great stories","types":["bad"]},
{"data":"Or terrible, horrifying, traumatic experiences","types":["bad"]},
{"data":"great clearly means different things to us","types":["bad"]},
{"data":"I dunno. We kind of want to have a hippie communing with nature type break. But because we're such alcoholics I feel like we'll just be wasted the whole time in addition to hugging trees","types":["bad"]},
{"data":"I used my tears to chase my tequila. You could say I rallied.","types":["bad"]},
{"data":"What does that mean when you have a child masturbating in your dream? Is that weird?","types":["bad"]},
{"data":"I think Saturday night will always be a mystery to me, except for buying an excessive amount of birthday shots for everyone and yelling BIRTHDAY SHOTS before every shot.","types":["bad"]},
{"data":"But how will the next generation learn about life choices without a Jersery Shore?","types":["bad"]},
{"data":"Dropping acid was like seeing the whole world as a blank canvas to imagine anything I wanted.","types":["bad"]},
{"data":"And apparently all you wanted was to watch the sun explode and me take 60,000 dicks to the face.","types":["bad"]},
{"data":"No it was good. I serenaded the holding cell occupants with a fabulous rendition of Making Love out of Nothing at all. It was fucking amazing!","types":["bad"]},
{"data":"I'm beginning to worry that I seem to get along best with people when I'm naked with them.","types":["bad"]},
{"data":"THIS CHICK IS LIKE SOME SORT OF HOOKER HOUDINI.","types":["bad"]},
{"data":"My condoms might be a little big for you but hey, a big sweater is better than no sweater at all when it's cold right?","types":["bad"]},
{"data":"Also, I found out that my dad has the name of every boy that I've ever dated and their physical description, car type and tag number stored in his computer.","types":["bad"]},
{"data":"Apparently Angela went missing once and he says he learned were to look first and that it's best to have information on hand.","types":["bad"]},
{"data":"Wanna smoke some ancient weed I just found in a box of cake mix?","types":["bad"]},
{"data":"Her craziness is the sexiest thing about her.","types":["bad"]},
{"data":"I can't wait to read your obituary.","types":["bad"]},
{"data":"You were naked with a chalice of Skittles vodka, singing along to Les Miserables.","types":["bad"]},
{"data":"I was just like oh sorry I'm peeling meanwhile my legs are on either side of his head and I look like a fucking Komodo dragon","types":["bad"]},
{"data":"In a bar surrounded by couples hooking up. I'm just staring at one. Not drunk enough. Come save me.","types":["bad"]},
{"data":"only i would grind with someone to harp music at a gay wedding","types":["bad"]},
{"data":"Hey, I told her the bathroom was a No fly zone after I used it. She willingly allowed her nose to go through that pain. It's her fault, she only supplied me with vodka when she knows I only drink rum.","types":["bad"]},
{"data":"Seriously, she had fingers that made me thank a god I don't even believe in that I'm gay.","types":["bad"]},
{"data":"My aunt comes over, haven't seen her in 4 years. First thing, looks me up and down and goes ...yup, that pair ripened nicely. Theyll get you some free drinks","types":["bad"]},
{"data":"I think you were raised by the wrong sister","types":["bad"]},
{"data":"I'm hurting so bad I actially had to wait for my mini wheats to get soggy before I could eat them..","types":["bad"]},
{"data":"Had a guy spin me around at the bar, kiss me then say oh shit you're not who I thought you were and then walk away.","types":["bad"]},
{"data":"Goodbye spring break, hello depressing video on AIDS.","types":["bad"]},
{"data":"WAKE UP!!! We have 20 minutes to get to class. That means we only have 10 minutes to get drunk.","types":["bad"]},
{"data":"Got into Princeton. So excited about the mommy-issue-over-achieving-cock I get to ride the next 4 years!!!","types":["bad"]},
{"data":"HOLD ONTO YOUR PANTIES AND SAY GOODBYE TO THE REMAINDER OF YOUR INTEGRITY","types":["bad"]},
{"data":"I don't want a mention or even a whisper of a Shakespeare Festival by that or any other name including, but not limited to, a fucking Renaissance Fair. Are we clear? It will be a DEALBREAKER .","types":["bad"]},
{"data":"I haven't been this unsober in a long time. I feel like I am observing myself. Like I am a test subject for alcohol. I wish my brain would shut up and let me be a normal drunk.","types":["bad"]},
{"data":"In two unrelated events today I have had frostbite on my toe and cum up my nose. Who says life stops when you get married?","types":["bad"]},
{"data":"preface to our conversation: my vagina hurts.","types":["bad"]},
{"data":"I have decided that today will be all about indulgence and hedonism.","types":["bad"]},
{"data":"Can someone please explain where the fish in the mason jar came from when we were at a bar all night? ","types":["bad"]},
{"data":"You told the bartender if he gave you one of the fish you'd go away","types":["bad"]},
{"data":"I know. I feel like I should be doing mature responsible adult things though. Like getting loans, working 60 hours every week and not eating burritos in bed, ya know?","types":["bad"]},
{"data":"I am making it a rule that only people I am comfortable around enough to not have to put a bra on are allowed for Sunday funday. I think that's a good rule for someone who started drinking alone at noon while everyone else here sipped their coffee.","types":["bad"]},
{"data":"Can we please start going to the gym before I accidentally kill someone via explosive fat girl pants button accident","types":["bad"]},
{"data":"A girl just asked me if we had pregnancy tests and a coworker had to stop me from telling her I was a pregnancy test. THAT is why I don't drink at work.","types":["bad"]},
{"data":"Her next conquest seems to be stealing her ex-boyfriend's new girlfriend. Pretty sure everyone involved is totally OK with this.","types":["bad"]},
{"data":"I approve. Last time I was there, I left E's room to get a drink of water. Found M sitting on the kitchen counter in his boxers hammered and eating a banana. He proceeded to feed me the rest of his banana then went to bed with the lights on. You two will be great.","types":["bad"]},
{"data":"These are all good points. But, I think your under estimating what it's like to be held upside down for a standing 69","types":["bad"]},
{"data":"Fastest way to get judgmental looks on a Sunday morning: wear sunglasses inside carrying a case of beer and thin mints at the grocery store. May or may not have ran into the glass door.","types":["bad"]},
{"data":"YOUR DICK HAS BEEN IN ME I DO NOT WANT TO BE SET UP TO MEET YOUR FRIENDS","types":["bad"]},
{"data":"Hey, so, you were my one phone call last night... Thanks for not picking up. See, this is why I never call you.","types":["bad"]},
{"data":"I feel like im becoming the girl who only drunk texts him. I would be in the dog house, if situations like this had dog houses.","types":["bad"]},
{"data":"I talk a lot when I drink rum. he was going down on me and i was telling him how i wished i could tap dance. oh god","types":["bad"]},
{"data":"Last I saw, they went for a smoke and only one came back. He passed out outside. I'm glad he's only 120lbs. I left him on the rug still. My mom is gonna be pissed.","types":["bad"]},
{"data":"Just jerked off with bubble wrap. Not as awesome as it sounds.","types":["bad"]},
{"data":"Unintentional and slightly frustrating adventures are basically all I'm good for. Expect heart palpitations, cheap food, and homeless men serenading us.","types":["bad"]},
{"data":"woke up to a family dragging me under their beach umbrella, they poured water on me bc they thought I was dead then fed me quesadillas and nursed me back to health... gotta love Cabo","types":["bad"]},
{"data":"pretty sure tht was the guy who once went to the club dressed as waldo. he still looks weirdly fuckable.","types":["bad"]},
{"data":"FUCK... Pulled a chick from the bar went to her house passed out on the shitter. She lives in a house full of girls. They were making poop jokes as i left","types":["bad"]},
{"data":"All I know is that every time I looked at my glass it was full again and I thought it would be rude not to drink it","types":["bad"]},
{"data":"At my place... I'm gonna be honest though stonewall Jackson is not going to be able to rally the troops. Too many shots of tequila","types":["bad"]},
{"data":"Never thought I would be taunted by little kids about my walk of shame","types":["bad"]},
{"data":"i made this one couple from ohio so uncomfortable that they left....and that was WHEN I HAD PANTS ON","types":["bad"]},
{"data":"I'm on the toilet with no toilet paper. When are you coming over? I'm contemplating on just staying here until you arrive.","types":["bad"]},
{"data":"to have them in my mouth would be like meeting a unicorn while floating on a cloud of glitter","types":["bad"]},
{"data":"Guess whose hungry like a hippo: this bitch.","types":["bad"]},
{"data":"Here you are just trying to masturbate and I'm talking to you like your an initiate for some secret society.","types":["bad"]},
{"data":"The water at the venue tasted HORRIBLE so I just kept drinking booze. It was like the medievals.","types":["bad"]},
{"data":"Yes... I'll kill two birds with one crazy ecstacy filled night.","types":["bad"]},
{"data":"Within the span of 10 minutes, I managed to make a slip 'n slide on his stomach, threatened to pee on him, kneed myself in the eye, and almost fell asleep on the toilet....in that order.","types":["bad"]},
{"data":"I thought I was pretty much sober now but then I realized I've been eating scrambled eggs with my hands...","types":["bad"]},
{"data":"So hungover im counting my own breaths to make sure im not dead. The odds hurt.","types":["bad"]},
{"data":"also please imagine me hopping a fence at 3am using two chairs. It was a shit show. K's guy practically ripped her off the top of the fence bc she got semi stuck. It was like watching Disney on Bud Ice.","types":["bad"]},
{"data":"Buy Actually if the police need to find my body I'm on an air mattress in an apartment near a McDonald's that's all I see out dat Window","types":["bad"]},
{"data":"I don't trust myself to shower and not drown.","types":["bad"]},
{"data":"Can I write your parents a thank-you note for your huge dick?","types":["bad"]},
{"data":"Dude it's huge. I don't usually like looking at those things, but you're kind of forced to stare that horse in the face.","types":["bad"]},
{"data":"he used the hotel microwave to cook the 16 pizza he bought at the walmart deli","types":["bad"]},
{"data":"He used a food city great value card to cut it","types":["bad"]},
{"data":"He got cut off by the bartender. So he kept buying people drinks of they would i get him a drink. Before you know it him and 8 people were outside the bat trying to get people. To by ","types":["bad"]},
{"data":"After her AA meeting, she was on the phone with her mom, and when she said, they're making me start over with Step 1, I quietly sang, cut a hole in the box.","types":["bad"]},
{"data":"I threw up in the kitchen on the floor and a guy tried cleaning it up with a spoon at a party.","types":["bad"]},
{"data":"My boyfriend just asked what time I was coming over.  As soon as my old BF unchains me.  I think he ran away.","types":["bad"]},
{"data":"He picked me up in the very car he devirginized me in, his moms toyota.","types":["bad"]},
{"data":"I wish buying curtains was as easy as buying drugs. I already KNOW what I want and what the outcome will be: awesome.","types":["bad"]},
{"data":"PS my house is a mess.","types":["bad"]},
{"data":"pps I have a rash on my face.","types":["bad"]},
{"data":"I vaguely remember the Health and Safety Inspector walking into my room this morning while I was passed out naked. That's one way to get it over with quickly.","types":["bad"]},
{"data":"They tried to dine n dash at dennys and the waiter jumped on their car and broke their windshield","types":["bad"]},
{"data":"I thought he was having it in Athens. Alright. Have fun. Please save my dignity and refrain from talking about my boobs and sexual abilities. If I have any. I just feel like they are going to ask. Repeat after me. And repeat it 5 more times. This is going to be the phrase you're going to rely on tonight: I can neither deny or confirm such actions.","types":["bad"]},
{"data":"Yeah. Well last night I sold my shoes to a man who I'm pretty sure has a weird foot fetish for $150 cash.","types":["bad"]},
{"data":"I feel like the fact that I slept with someone who dresses up like Batman a few times will never be lived down.","types":["bad"]},
{"data":"Ya, so he said he had to change before he would go to Pizza Hut because he pissed himself.  He ran into his house and came back wearing a cowboy hat.........and his piss covered jeans.","types":["bad"]},
{"data":"Well I'm sorry but he seemed so happy being drunk at noon.","types":["bad"]},
{"data":"We are planning a drunk snapchat treasure hunt for tomorrow, and the treasure is his penis, this is a game I'm not willing to loose.","types":["bad"]},
{"data":"If I come in tomorrow with a cane and a seeing eye dog it's because I just mixed up my salicylic acid acne stuff with my eye makeup remover","types":["bad"]},
{"data":"Nothing with ever convince me that she wasnt purposely left behind by our mother to ruin my life and fuck our family","types":["bad"]},
{"data":"Dude are you being arrested? I swear I just saw you laying on the hood of your car with a cop patting you down...","types":["bad"]},
{"data":"we tried to exchange flip flops in the parking lot and fell over then army crawled home","types":["bad"]},
{"data":"She curled up in the corner, screamed THE BLANKET IS SO WARM and promptly passed out with her face in the dogbed. No one bothered to reposition her.","types":["bad"]},
{"data":"Shame?!? Shame only comes from getting naked in front of strangers and it not being awesome","types":["bad"]},
{"data":"Remember that time you gave me a fat lip with your vag?  We should do that again!","types":["bad"]},
{"data":"You're wrong. It's my BIRTHDAY. We all know it's impossible to get pregnant on my diva day!","types":["bad"]},
{"data":"I'm still pretty drunk right now, but when this hangover hits me, I'm going to be super pissed. It's a preemptive never drinking again.","types":["bad"]},
{"data":"He's getting me an energy drink and said good morning beautiful. He must sense i'm cutting him off from the sex.","types":["bad"]},
{"data":"While he was gone for spring break I took his head board... I don't wanna wake up from his shenanigans for the rest of my college career.","types":["bad"]},
{"data":"I found three vicadin and a pint of fireball with the note. In case of emergency drink me under their sink.","types":["bad"]},
{"data":"I have chafed skin from the handy she  gave me. I told her that and she said return the favor when it heals. I'm in love.","types":["bad"]},
{"data":"Sex on the scooter in the parking lot wasn't the smartest idea. Actual quote from the cop as he handed me the ticket and fist  bumped me.","types":["bad"]},
{"data":"TONIGHT IS GOING TO BE A FUCKING BLAST. EVEN IF I HAVE TO SET OFF A BUNCH OF FIREWORKS IN YOUR KITCHEN.","types":["bad"]},
{"data":"I have made the descision to sacrifice the first of my family's dogs that wakes me before noon tomorrow. I may quickly become the family outcast","types":["bad"]},
{"data":"25 likes of a picture on Instagram of my butthole. beat that.","types":["bad"]},
{"data":"Douchebag of the Year award goes to the guy who didn't reply to the picture of my tits.","types":["bad"]},
{"data":"The extent of getting it in was this creepy guy sticking his finger in my bellybutton","types":["bad"]},
{"data":"Also I just sneezed literally 12 times in a row so violently...boogers everywhere. Sorry to ruin the sexting. I just felt like you had to know","types":["bad"]},
{"data":"Biggg time.  I found 2 empty packages of extenze in my car this am.... not sure what that was all about","types":["bad"]},
{"data":"The ketchup exploded, and totally splooged his face and the wall. You could see the outline of his head in the wall splatter.","types":["bad"]},
{"data":"didn't realize her mom was home while we were fucking, but she's oddly okay with it. she made us food afterwards. but then kept talking about having grand kids the whole time. is it time ","types":["bad"]},
{"data":"Some lady just walked up to me in the bar and proclaimed that I looked like a shady motherfucker. Can't argue with that one.","types":["bad"]},
{"data":"my head feels like a yellow yolk spinning in a circle at the bottom of the bowl..  i may have a concussion, love auto correct","types":["bad"]},
{"data":"When asked if they had been introduced, Damo said No but I know we've pretty much fucked all the same girls in town","types":["bad"]},
{"data":"Man, I want to make his penis a sandwich.","types":["bad"]},
{"data":"I'm having an emotional breakdown watching baby sloths on YouTube you need to come save me from myself.","types":["bad"]},
{"data":"What is soo wrong about a house of half-naked people hugging each other and laughing? ","types":["bad"]},
{"data":"The pinata full of drugs?","types":["bad"]},
{"data":"why can't I meet attractive men at the places I like to hang out? like books a million. or the liquor store.","types":["bad"]},
{"data":"Can you bring home bongs? Like all the bongs. I need bongs","types":["bad"]},
{"data":"I knew us throwing ourselves at him back in the day would pay off. I'm gonna b a divorcees rebound. Score!","types":["bad"]},
{"data":"Why do I have the 4 of hearts in my bra?","types":["bad"]},
{"data":"Haha we got sick of drinking on 4 is for whores so we stole the cards...I woke up with three of them in mine","types":["bad"]},
{"data":"drunken problem solving at its finest","types":["bad"]},
{"data":"If I get aids I am starting a lawsuit against snapchat.","types":["bad"]},
{"data":"Found a piece of twizzler in my buttcrack.","types":["bad"]},
{"data":"We could have casual sex if you want. But I can't offer a bromance to a woman.","types":["bad"]},
{"data":"Seriously, this apartment is covered in body glitter. This chick musta been a huuuuuge slut. How do you get it across every surface?","types":["bad"]},
{"data":"Do you have any forwarding contact info?","types":["bad"]},
{"data":"who's idea was it to start the NCAA tournament less than a week after St. Patrick's day? My liver needs time to recover for things like this.","types":["bad"]},
{"data":"I picked up the bartender so he could open the bar early and ended up with him giving me a ride home when he closed.  I like snowdays and everything, but they get really expensive.  Also, I think I threw up on his front door. Not checking.","types":["bad"]},
{"data":"I may, or may not have licked his face in an Applebee's.","types":["bad"]},
{"data":"I told him if he cums in my mouth he has to buy me a cake that says sorry I came in your mouth","types":["bad"]},
{"data":"She's opening her family birthday cards at the bar. So we can pay our tab. Bitches wrote checks :(","types":["bad"]},
{"data":"I broke out the Krispy Kreme, and am possibly having random internet sex in less than an hour.  I think I got this breakup under control.","types":["bad"]},
{"data":"You were great dude. You wanted to charge the guy with fedora $100 to get in.","types":["bad"]},
{"data":"did you know gatorade and rum go really good together","types":["bad"]},
{"data":"Are you doing depressed science again","types":["bad"]},
{"data":"Stephen I'm in a lecture and the lecturer just said 'you can CHOOSE to put something in your mouth and swallow it i'm the only one here who burst out laughing, this is awkward. Thought you'd appreciate it.","types":["bad"]},
{"data":"They'll never let you practice medicine.","types":["bad"]},
{"data":"after the fucking you spent twenty minutes vomiting naked and shaking your dick at my roommates. luckily, i don't remember that, or i'd have to be really insulted.","types":["bad"]},
{"data":"Why didn't you tell me I was calling her by her sisters name all night?","types":["bad"]},
{"data":"Dude it's SB. It's a proven fact that all you need to survive on is beer, weed, chips and maybe some amphetamines","types":["bad"]},
{"data":"She told me to pick her up in the corner of shame and self-disgust.","types":["bad"]},
{"data":"he shit on the floor last night i'm not venturing down there","types":["bad"]},
{"data":"Your vase full of piss was still at his house and he still doesn't know.","types":["bad"]},
{"data":"Don't know why you're always hating on relationships. I've had chocolate pancakes accompanied by a blowjob and a blunt and it's not even 9 am. Time for mid morning shower sex. Enjoy your morning bong bowl alone asshole","types":["bad"]},
{"data":"If a baby can come out of it, so can four raquetballs.","types":["bad"]},
{"data":"Some fat latino guy has these 2 fat white moms making out with each other on the dance floor","types":["bad"]},
{"data":"All I know is you walked out of the kitchen in some kind of French onion dip bra and started passing out individual chips to guys saying do you dip?","types":["bad"]},
{"data":"Bring the pizza ill bring the boundaries we can cross","types":["bad"]},
{"data":"Just made a memo in my blackberry that contains seth's funeral arrangements. I have a feeling he has big plans for the weekend.","types":["bad"]},
{"data":"That's the last time I get in a car with six rappers headed to god knows where.","types":["bad"]},
{"data":"Whoever labeled dysfunctional a bad thing obviously never saw this frinedship coming.","types":["bad"]},
{"data":"I lost in a drinking contest with my 84 year old grandmother. Two years in a row now.","types":["bad"]},
{"data":"Sarah's knitting me a hat as an apology for unknowingly making out with my boyfriend","types":["bad"]},
{"data":"I love it when he cheats on me with nice people","types":["bad"]},
{"data":"Those were some damn good pancakes you made last night. ","types":["bad"]},
{"data":"Dude I've been in FL since Monday.","types":["bad"]},
{"data":"its 2pm. u awake yet?","types":["bad"]},
{"data":"ill text u back later. still peeling fingernail polish off my face.","types":["bad"]},
{"data":"Officially drug you out of White Castle last night by the hood on your sweatshirt after you cussed out the attendant and stole the satisfaction guaranteed sign because they were closed!","types":["bad"]},
{"data":"And then we felt it necessary to continue drinking for another 4 hours, yikes","types":["bad"]},
{"data":"Can you please come and collect your boss off of my kitchen floor.","types":["bad"]},
{"data":"Do you want the fat one with an ok face or the skinny ugly one?","types":["bad"]},
{"data":"It doesn't matter as long as our shame is in tandem.","types":["bad"]},
{"data":"The guy I brought home last night made a speedy escape while I was in the bathroom. The only trace I found of his flight was a lone sock on the stairs.... It was like a whorey low budget Cinderella","types":["bad"]},
{"data":"I'm in a dress, surrounded by Republicans, and the bartender just told me he's out of Jack Daniels in a very accusatory tone. Shit, is it only 8 PM?","types":["bad"]},
{"data":"Apparently it's bring your ugly annoying ass piece of shit slob of a baby day at work","types":["bad"]},
{"data":"A little sexual choking never killed anyone. And if it did, they died happy.","types":["bad"]},
{"data":"The bag I'm bringing home for the weekend: a change of clothes, workout shoes, and sex toys, that's it.","types":["bad"]},
{"data":"Shotgunning beers to finish a midterm project at 3am is a good idea right?","types":["bad"]},
{"data":"After he finished he sang his college fight song like it was some victory","types":["bad"]}
]